## apply自定义函数
**比调用循环处理数据，快！适用于pandas内置函数不满足时**

In [2]:
import pandas as pd

### 一、使用方法

In [5]:
df = pd.DataFrame({'a': [10, 20, 30], 'b':[20, 30, 40]})
df

    a   b
0  10  20
1  20  30
2  30  40

#### 1.1 Serise.apply

In [9]:
# 定义自定义的方法，可以定义多个参数的函数，但是第一个参数从Series来，其他参数需要调用apply时传入
def func(x, e):
    return x ** e

In [10]:
# 使用apply
result = df['a'].apply(func, e=3)
result

0     1000
1     8000
2    27000
Name: a, dtype: int64

#### 1.2 DataFrame.apply

- axis 默认0，传入自定义函数的是列，1传入行
- 传入自定义函数的是Series

In [12]:
df.apply(func, e=2)

     a     b
0  100   400
1  400   900
2  900  1600

In [47]:
titanic = pd.read_csv('./data/titanic_train.csv')
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [54]:
def cut_age(x):
    age = x['Age']
    if age < 18:
        return '少年'
    elif age < 40:
        return '青年'
    elif age < 60:
        return '中年'
    elif age < 80:
        return '老年'
    else:
        return '未知'

titanic['Age1'] = titanic.apply(cut_age, axis=1)
titanic.groupby('Age1').count()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Age1,,,,,,,,,,,,
中年,137,137,137,137,137,137,137,137,137,137,57,137
少年,113,113,113,113,113,113,113,113,113,113,19,113
未知,178,178,178,178,178,1,178,178,178,178,20,178
老年,25,25,25,25,25,25,25,25,25,25,12,24
青年,438,438,438,438,438,438,438,438,438,438,96,437

In [16]:
def set_vip(x):
    if x['Pclass'] == 1 and ('Master' in x['Name'] or 'Dr' in x['Name'] or 'Sir' in x['Name']):
        return 'VIP'
    else:
        return 'Normal'

In [17]:
titanic['VIP'] = titanic.apply(set_vip, axis=1)
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,VIP
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Normal
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Normal
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Normal
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Normal
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Normal
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Normal
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Normal
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Normal
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Normal
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Normal

In [19]:
titanic.groupby('VIP').count()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
VIP,,,,,,,,,,,,
Normal,881,881,881,881,881,705,881,881,881,881,196,879
VIP,10,10,10,10,10,9,10,10,10,10,8,10